In [99]:
import os
import snowflake.connector
import pandas as pd

In [100]:
# Conectar a Snowflake
conn = snowflake.connector.connect(
    user=os.getenv("SNOWFLAKE_USER"),
    password=os.getenv("SNOWFLAKE_PASSWORD"),
    account=os.getenv("SNOWFLAKE_ACCOUNT"),
    warehouse=os.getenv("SNOWFLAKE_WAREHOUSE"),
    database=os.getenv("SNOWFLAKE_DATABASE"),
    schema=os.getenv("SNOWFLAKE_SCHEMA")
)

In [101]:
# Ejecutar una consulta de prueba
cursor = conn.cursor()
cursor.execute("SELECT CURRENT_VERSION()")
version = cursor.fetchone()
print(f"Conectado a Snowflake. Versión: {version[0]}")

Conectado a Snowflake. Versión: 9.2.7

In [102]:
cursor.execute("SHOW DATABASES")
databases = cursor.fetchall()
for db in databases:
    print(db[1])

INSTACART_DB
RAPPIDB
SNOWFLAKE
SNOWFLAKE_SAMPLE_DATA

In [103]:
cursor.execute("SHOW SCHEMAS IN INSTACART_DB")
schemas = cursor.fetchall()
for schema in schemas:
    print(schema[1])

INFORMATION_SCHEMA
PUBLIC
RAW

In [104]:
cursor.execute("SHOW TABLES IN INSTACART_DB.RAW")
tables = cursor.fetchall()
for table in tables:
    print(table[1])

aisles
departments
order_products
orders
products

In [105]:
cursor.execute("USE DATABASE INSTACART_DB")
cursor.execute("USE SCHEMA RAW")

In [106]:
# Primero analizamos la tabla "aisles.RAW"

In [107]:
query_aisles = 'SELECT * FROM "aisles";' 
df_aisles = pd.read_sql(query_aisles, conn)

/var/folders/1p/fq1m75_x51v5l3dmf0wxswbr0000gn/T/ipykernel_46666/1964321211.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_aisles = pd.read_sql(query_aisles, conn)

In [108]:
df_aisles

     aisle_id                       aisle
0           1       prepared soups salads
1           2           specialty cheeses
2           3         energy granola bars
3           4               instant foods
4           5  marinades meat preparation
..        ...                         ...
129       130    hot cereal pancake mixes
130       131                   dry pasta
131       132                      beauty
132       133  muscles joints pain relief
133       134  specialty wines champagnes

[134 rows x 2 columns]

In [109]:
df_aisles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134 entries, 0 to 133
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   aisle_id  134 non-null    int64
 1   aisle     134 non-null    object
dtypes: int64(1), object(1)
memory usage: 2.2+ KB

In [110]:
df_aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [111]:
num_rows_aisles, num_columns_aisles = df_aisles.shape
print(f"La tabla 'aisles' tiene {num_rows_aisles} filas y {num_columns_aisles} columnas.")

La tabla 'aisles' tiene 134 filas y 2 columnas.

In [112]:
num_unique_aisles = df_aisles['aisle'].nunique()

In [113]:
num_unique_aisles

134

In [114]:
# Todas las filas tienen nombre únicos

In [115]:
print("Resumen estadístico de la tabla 'aisles':")
print(df_aisles.describe(include="all"))

Resumen estadístico de la tabla 'aisles':
          aisle_id                  aisle
count   134.000000                    134
unique         NaN                    134
top            NaN  prepared soups salads
freq           NaN                      1
mean     67.500000                    NaN
std      38.826537                    NaN
min       1.000000                    NaN
25%      34.250000                    NaN
50%      67.500000                    NaN
75%     100.750000                    NaN
max     134.000000                    NaN

In [116]:
# Valores nulos
print("Valores nulos por columna:")
print(df_aisles.isnull().sum())

Valores nulos por columna:
aisle_id    0
aisle       0
dtype: int64

In [117]:
# Ver duplicados
print("Número de filas duplicadas:", df_aisles.duplicated().sum())

Número de filas duplicadas: 0

In [118]:
# Revisar tipos de datos
print("Tipos de datos en la tabla:")
print(df_aisles.dtypes)

Tipos de datos en la tabla:
aisle_id     int64
aisle       object
dtype: object

In [119]:
# Seguimos con la tabla "departments.RAW "

In [120]:
query_departments = 'SELECT * FROM "departments";' 
df_departments = pd.read_sql(query_departments, conn)

/var/folders/1p/fq1m75_x51v5l3dmf0wxswbr0000gn/T/ipykernel_46666/3260563204.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_departments = pd.read_sql(query_departments, conn)

In [121]:
df_departments

    department_id       department
0               1           frozen
1               2            other
2               3           bakery
3               4          produce
4               5          alcohol
5               6    international
6               7        beverages
7               8             pets
8               9  dry goods pasta
9              10             bulk
10             11    personal care
11             12     meat seafood
12             13           pantry
13             14        breakfast
14             15     canned goods
15             16       dairy eggs
16             17        household
17             18           babies
18             19           snacks
19             20             deli
20             21          missing

In [122]:
df_departments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   department_id  21 non-null     int64
 1   department     21 non-null     object
dtypes: int64(1), object(1)
memory usage: 468.0+ bytes

In [123]:
num_rows_departments, num_columns_departments = df_departments.shape
print(f"La tabla 'departments' tiene {num_rows_departments} filas y {num_columns_departments} columnas.")

La tabla 'departments' tiene 21 filas y 2 columnas.

In [124]:
print("\nResumen estadístico de la tabla 'departments':")
print(df_departments.describe(include="all"))

Resumen estadístico de la tabla 'departments':
        department_id department
count       21.000000         21
unique            NaN         21
top               NaN     frozen
freq              NaN          1
mean        11.000000        NaN
std          6.204837        NaN
min          1.000000        NaN
25%          6.000000        NaN
50%         11.000000        NaN
75%         16.000000        NaN
max         21.000000        NaN

In [125]:
# Valores nulos
print("\nValores nulos por columna:")
print(df_departments.isnull().sum())

Valores nulos por columna:
department_id    0
department       0
dtype: int64

In [126]:
# duplicados
duplicados = df_departments[df_departments.duplicated(subset=['department'], keep=False)]
print("\nDepartamentos duplicados:")
print(duplicados)

Departamentos duplicados:
Empty DataFrame
Columns: [department_id, department]
Index: []

In [127]:
# Seguimos con la tabla "order_products"

In [128]:
query_order_products = 'SELECT * FROM "order_products";' 
df_order_products = pd.read_sql(query_order_products, conn)

/var/folders/1p/fq1m75_x51v5l3dmf0wxswbr0000gn/T/ipykernel_46666/1118289459.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_order_products = pd.read_sql(query_order_products, conn)

In [129]:
df_order_products

         order_id  product_id  add_to_cart_order  reordered
0               4       10054                5.0          1
1               4       17616               10.0          1
2               4       21351                6.0          1
3               4       22598                7.0          1
4               4       25146               11.0          1
...           ...         ...                ...        ...
4545002   3421077       26940                3.0          0
4545003   3421077       27845                4.0          0
4545004   3421077       27966                1.0          0
4545005   3421077       45007                2.0          0
4545006   3421079       30136                1.0          0

[4545007 rows x 4 columns]

In [130]:
df_order_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4545007 entries, 0 to 4545006
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  float64
 3   reordered          int64
dtypes: float64(1), int64(3)
memory usage: 138.7 MB

In [131]:
num_rows_order_products, num_columns_order_products = df_order_products.shape
print(f"La tabla 'departments' tiene {num_rows_order_products} filas y {num_columns_order_products} columnas.")

La tabla 'departments' tiene 4545007 filas y 4 columnas.

In [132]:
# Resumen estadístico
print("\nResumen estadístico de la tabla 'order_products':")
print(df_order_products.describe(include="all"))

Resumen estadístico de la tabla 'order_products':
           order_id    product_id  add_to_cart_order     reordered
count  4.545007e+06  4.545007e+06       4.544171e+06  4.545007e+06
mean   1.711166e+06  2.558084e+04       8.351669e+00  5.905025e-01
std    9.850955e+05  1.409552e+04       7.080368e+00  4.917411e-01
min    4.000000e+00  1.000000e+00       1.000000e+00  0.000000e+00
25%    8.608170e+05  1.353500e+04       3.000000e+00  0.000000e+00
50%    1.711530e+06  2.527200e+04       6.000000e+00  1.000000e+00
75%    2.561311e+06  3.793500e+04       1.100000e+01  1.000000e+00
max    3.421079e+06  4.969400e+04       6.400000e+01  1.000000e+00

In [133]:
# Contar valores nulos por columna
print("\nValores nulos por columna:")
print(df_order_products.isnull().sum())

Valores nulos por columna:
order_id               0
product_id             0
add_to_cart_order    836
reordered              0
dtype: int64

In [134]:
# Filtrar y mostrar registros con valores nulos en 'add_to_cart_order'
df_null_add_to_cart = df_order_products[df_order_products['add_to_cart_order'].isnull()]
print(df_null_add_to_cart)

         order_id  product_id  add_to_cart_order  reordered
12802        9310       25753                NaN          0
82485       61355        1087                NaN          0
82487       61355        1203                NaN          0
82489       61355        1700                NaN          0
82492       61355        3390                NaN          0
...           ...         ...                ...        ...
4494959   3383594          63                NaN          0
4494982   3383594       15076                NaN          0
4494984   3383594       15424                NaN          1
4495022   3383594       46710                NaN          0
4495027   3383594       49144                NaN          1

[836 rows x 4 columns]

In [ ]:
df_order

In [135]:
#Ver si ciertos order_id tienen más valores nulos que otros. Esto nos ayuda a ver si hay un patrón en ciertos pedidos.
df_null_add_to_cart['order_id'].value_counts()

order_id
61355      63
3308010    51
2136777    44
171934     40
1959075    34
           ..
888470      1
1598369     1
747668      1
1677118     1
9310        1
Name: count, Length: 70, dtype: int64

In [136]:
#Ver si los valores nulos están asociados a ciertos product_id
df_null_add_to_cart['product_id'].value_counts()

product_id
11193    4
24852    4
21137    4
27555    4
40709    4
        ..
30552    1
41960    1
48679    1
7401     1
49144    1
Name: count, Length: 720, dtype: int64

In [137]:
df_order_products['add_to_cart_order'].isnull().sum()  # Filas con NaN

836

In [138]:
df_order_products['add_to_cart_order'].notnull().sum()  # Filas con datos

4544171

In [139]:
df_order_products.shape[0] #Total de filas

4545007

In [140]:
# La columna add_to_cart_order indica la posición en la que un producto
# fue agregado al carrito dentro de una orden específica.

In [181]:
# Ver ejemplos de productos con add_to_cart_order nulo
df_order_products[df_order_products['add_to_cart_order'].isnull()].head()

       order_id  product_id  add_to_cart_order  reordered
12802      9310       25753                NaN          0
82485     61355        1087                NaN          0
82487     61355        1203                NaN          0
82489     61355        1700                NaN          0
82492     61355        3390                NaN          0

In [184]:
# Analizar si los productos con NaN pertenecen a órdenes recurrentes
df_order_products[df_order_products['add_to_cart_order'].isnull()]['order_id'].value_counts().head()

order_id
61355      63
3308010    51
2136777    44
171934     40
1959075    34
Name: count, dtype: int64

In [186]:
# Ver si hay una relación con la frecuencia de compra
df_order_products[df_order_products['add_to_cart_order'].isnull()].groupby('reordered').size()

reordered
0    517
1    319
dtype: int64

In [141]:
# Vamos con la tabla "orders"

In [142]:
query = 'SELECT * FROM "orders";'
df_orders = pd.read_sql(query, conn)

/var/folders/1p/fq1m75_x51v5l3dmf0wxswbr0000gn/T/ipykernel_46666/1308945861.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_orders = pd.read_sql(query, conn)

In [143]:
# Número de filas y columnas
num_rows_orders, num_columns_orders = df_orders.shape
print(f"La tabla 'orders' tiene {num_rows_orders} filas y {num_columns_orders} columnas.")

La tabla 'orders' tiene 478967 filas y 7 columnas.

In [144]:
# Ver las primeras filas
df_orders.head()

,id,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1,1515936,183418,11,6,13,30.0
1,2,1690866,163593,5,5,12,9.0
2,3,1454967,39980,4,5,19,2.0
3,4,1768857,82516,56,0,20,10.0
4,5,3007858,196724,2,4,12,17.0

In [145]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478967 entries, 0 to 478966
Data columns (total 7 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   id                      478967 non-null  int64
 1   order_id                478967 non-null  int64
 2   user_id                 478967 non-null  int64
 3   order_number            478967 non-null  int64
 4   order_dow               478967 non-null  int64
 5   order_hour_of_day       478967 non-null  int64
 6   days_since_prior_order  450148 non-null  float64
dtypes: float64(1), int64(6)
memory usage: 25.6 MB

In [146]:
df_orders.describe(include="all")

,id,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,478967.000000,4.789670e+05,478967.000000,478967.000000,478967.000000,478967.000000,450148.000000
mean,239484.000000,1.709947e+06,102966.537475,17.157808,2.775058,13.446676,11.101751
std,138266.007529,9.869480e+05,59525.328991,17.704688,2.045869,4.224986,9.189975
min,1.000000,4.000000e+00,2.000000,1.000000,0.000000,0.000000,0.000000
25%,119742.500000,8.564685e+05,51414.000000,5.000000,1.000000,10.000000,4.000000
50%,239484.000000,1.709522e+06,102633.000000,11.000000,3.000000,13.000000,7.000000
75%,359225.500000,2.562990e+06,154419.000000,23.000000,5.000000,16.000000,15.000000
max,478967.000000,3.421079e+06,206209.000000,100.000000,6.000000,23.000000,30.000000

In [147]:
print("Valores nulos por columna:")
print(df_orders.isnull().sum())

Valores nulos por columna:
id                            0
order_id                      0
user_id                       0
order_number                  0
order_dow                     0
order_hour_of_day             0
days_since_prior_order    28819
dtype: int64

In [148]:
#Esto nos mostrará las filas donde days_since_prior_order es NaN.
df_orders[df_orders['days_since_prior_order'].isnull()]

,id,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
28,29,133707,182261,1,3,10,NaN
96,97,787445,25685,1,6,18,NaN
100,101,294410,111449,1,0,19,NaN
103,104,2869915,123958,1,4,16,NaN
104,105,2521921,42286,1,3,18,NaN
...,...,...,...,...,...,...,...
478895,478896,2589657,205028,1,0,16,NaN
478896,478897,2222353,141211,1,2,13,NaN
478922,478923,2272807,204154,1,1,15,NaN
478926,478927,2499542,68810,1,4,19,NaN
478945,478946,1387033,22496,1,5,14,NaN

In [149]:
# La columna days_since_prior_order representa el número de días transcurridos
# desde el pedido anterior realizado por el mismo usuario.

In [150]:
df_orders[df_orders['days_since_prior_order'].isnull()]['order_number'].value_counts()

order_number
1    28819
Name: count, dtype: int64

In [151]:
# Los valores NaN en la columna days_since_prior_order corresponden exclusivamente a pedidos con order_number = 1
# lo que confirma que estos valores indican la primera compra de cada usuario en la plataforma.

In [152]:
# Hay duplicados?

In [153]:
print("Número de filas duplicadas:", df_orders.duplicated().sum())

Número de filas duplicadas: 0

In [154]:
#Analizar tabla "products"

In [155]:
query = 'SELECT * FROM "products";'
df_products = pd.read_sql(query, conn)

/var/folders/1p/fq1m75_x51v5l3dmf0wxswbr0000gn/T/ipykernel_46666/2404336960.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_products = pd.read_sql(query, conn)

In [156]:
df_products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [157]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49694 entries, 0 to 49693
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49694 non-null  int64
 1   product_name   48436 non-null  object
 2   aisle_id       49694 non-null  int64
 3   department_id  49694 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [158]:
print("Valores nulos por columna:")
print(df_products.isnull().sum())

Valores nulos por columna:
product_id          0
product_name     1258
aisle_id            0
department_id       0
dtype: int64

In [159]:
print("Número de filas duplicadas:", df_products.duplicated().sum())

Número de filas duplicadas: 0

In [160]:
# Hay 1258 valores nulos en la columna product_name
# lo que indica que hay productos sin nombre registrado.

In [161]:
df_products[df_products['product_name'].isnull()]

       product_id product_name  aisle_id  department_id
37             38         None       100             21
71             72         None       100             21
109           110         None       100             21
296           297         None       100             21
416           417         None       100             21
...           ...          ...       ...            ...
49552       49553         None       100             21
49574       49575         None       100             21
49640       49641         None       100             21
49663       49664         None       100             21
49668       49669         None       100             21

[1258 rows x 4 columns]

In [162]:
df_products[df_products['product_name'].isnull()]['aisle_id'].value_counts()

aisle_id
100    1258
Name: count, dtype: int64

In [163]:
df_products[df_products['product_name'].isnull()]['department_id'].value_counts()

department_id
21    1258
Name: count, dtype: int64

In [164]:
# Se ve que los valores nulos corresponden al departament_id = 21 y aisles_id = 100

In [165]:
df_aisles[df_aisles['aisle_id'] == 100]

    aisle_id    aisle
99       100  missing

In [166]:
df_departments[df_departments['department_id'] == 21]

    department_id department
20             21    missing

Conclusiones y plan de acción

1.	Se identificaron valores nulos en la columna add_to_cart_order de la tabla order_products, esta columna indica la posición en la que un producto fue agregado al carrito dentro de una orden específica.
2.	En la tabla orders, los valores nulos en la columna days_since_prior_order corresponden exclusivamente a pedidos con order_number = 1, lo que sugiere que estos representan la primera compra de cada usuario en la plataforma.
3.	En la tabla products, se detectaron valores nulos en la columna product_name, lo que indica que ciertos productos no tienen nombre registrado. Además, estos productos están asociados a department_id = 21 y aisle_id = 21, cuyos valores en sus respectivas tablas aparecen como “missing”.

In [180]:
#Limpieza de valores ausentes (imputación, eliminación).

In [190]:
# "add_to_cart_orders" puede indicar una compra sin una secuencia específica.
# Productos añadidos de otra forma

In [192]:
df_order_products['add_to_cart_order'] = df_order_products['add_to_cart_order'].fillna(-1)

In [195]:
# Dado que los valores nulos en days_since_prior_order corresponden exclusivamente a order_number = 1
# lo más lógico es interpretarlos como que no hay un tiempo previo de compra ya que representan la primera compra del usuario.

In [197]:
df_orders['days_since_prior_order'] = df_orders['days_since_prior_order'].fillna(0)

In [198]:
df_products['product_name'] = df_products['product_name'].fillna('Producto desconocido')

In [202]:
# ver tipos de datos

In [203]:
df_orders.dtypes

id                          int64
order_id                    int64
user_id                     int64
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [204]:
df_order_products.dtypes

order_id               int64
product_id             int64
add_to_cart_order    float64
reordered              int64
dtype: object

In [205]:
df_products.dtypes

product_id        int64
product_name     object
aisle_id          int64
department_id     int64
dtype: object

In [211]:
# Tablas de Dimensiones (Descriptivas)

dim_products → Información de los productos.
	•	product_id (PK)
	•	product_name
	•	aisle_id (FK → dim_aisles)
	•	department_id (FK → dim_departments)

dim_aisles → Información de pasillos.
	•	aisle_id (PK)
	•	aisle_name

dim_departments → Información de departamentos.
	•	department_id (PK)
	•	department_name

dim_orders → Información de órdenes.
	•	order_id (PK)
	•	user_id
	•	order_number
	•	order_dow (Día de la semana)
	•	order_hour_of_day
	•	days_since_prior_order

In [209]:
# Tabla de Hechos (Eventos de compra)

fact_order_products → Registra compras de productos por usuario.
	•	order_id (FK → dim_orders)
	•	product_id (FK → dim_products)
	•	add_to_cart_order
	•	reordered